server/app/controllers/job_posts_controller.rb

    def create
        @job_post=JobPost.new job_post_params

        @job_post.user=current_user
        if @job_post.save
---
INSERT INTO "job_posts" ("title", "description", "min_salary", "max_salary", "created_at", "updated_at", "location", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update

        if @job_post.update job_post_params
---
UPDATE "job_posts" SET "title" = $1, "updated_at" = $2 WHERE "job_posts"."id" = $3  [["title", "Forward Orchestrator9 plus some changes!!!"], ["updated_at", "2021-01-20 19:43:57.116892"], ["id", 91]]

    def destroy
        if can?(:delete,@job_post)
            @job_post.destroy
---
DELETE FROM "job_posts" WHERE "job_posts"."id" = $1  [["id", 169]]

    def find_job_post
        @job_post=JobPost.find params[:id]
---
SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = $1 LIMIT $2  [["id", 239], ["LIMIT", 1]]